app/controllers/items_controller.rb

INSERT INTO "items" ("name", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Yogurt"], ["quantity", 5], ["created_at", "2019-01-31 21:23:07.147865"], ["updated_at", "2019-01-31 21:23:07.147865"]]
---
    def create
        Item.create(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
---
    def destroy
        @item = Item.find(params[:id])
        @item.destroy